// глава 3,1.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include "iostream"
#include "string"
#include "vector"
#include "algorithm"
#include "cmath"

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");

	cout << "Пожалуйста, введите целое число: " ;
	int n;
	cin >> n;
	double d_n = n;
	cout << "n == " << n
	<< "\nn+l == " << n+1
	<< "\nтри раза по n == " << 3*n
	<< "\nдва раза по n == " << n+n
	<< "\nn в квадрате == " << n*n
	<< "\nполовина n == " << n/2
	<< "\nделение n на 3 без остатка == " << n/3
	<< "\nостаток от деления n на 3 == " << n%3
	<< "\nделение n на 4 без остатка == " << n/4
	<< "\nостаток от деления n на 4 == " << n%4
	<< "\nделение n на 5 без остатка == " << n/5
	<< "\nостаток от деления n на 5 == " << n%5
	<< "\nделение n на 6 без остатка == " << n/6
	<< "\nостаток от деления n на 6 == " << n%6
	<< "\nкорень квадратный из n == " << sqrt (d_n)
	<< '\n'; // Переход на новую строку
	system ("pause");
	return 0;
}


